export const sayConstant = [
    // 歌词
    [
        '透明的水如镜', '指尖轻触水面', '寂静中 时间流逝之声', '也溶解在泡沫中', '曾出现在梦中的', '琉璃色的夜晚', 
        '若是沉沦在其中的话', '水镜倒映的幻想', '翠色中映出的', '是思慕的身影', '若是要像这样', '孤独度过余生的话', 
        '向过去送出道别', '至少', '让我有个美丽的终结吧'
    ],  // 水镜 - 蓝月なくる
    [
        '君が僕に見せてくれた', '世界はとても', '綺麗だったな'
    ],  // 僕は... - あたらよ
    [
        '长夜继续 轻裹街道', '身感淡淡春息与温度', '以百倍速度流逝的季节', '正离我而去', '挥之不去的不安', '束缚着我', 
        '就快将我摧毁', '帚星光芒于远方渗出', '名为自由的刑罚', '好似置于我身', '令我无路可退', '难忍呐喊的冲动', 
        '从不为人所知', '朝思暮想却不可至', '驶向月球的列车', '今晚启程'
    ],  // 星回诗歌 - suis
    [
        '将车票放于口袋之中', '在这拂过生命长河', '的时光中', '我明知命运无法改变', '无论是未知的花名',
        '还是沉眠的梦想', '是在中途车站等着谁呢', '点起些许勇气', '轻哼星回诗歌', '已然摇摇欲坠的', '小小房间',
        '将手置于紧闭的门扉上', '将其敞开', '迈向春风所唤之处', '抵达时刻', '不曾回首地', '在内心动摇前踏出脚步',
        '如梦似幻',
    ],  // 星回诗歌 - suis
    [
        '今夜', '我乘上驶向月球的列车', '攥紧那张车票', '聆听旅笛响起', '请将我带去某个', '遥远的地方吧',
        '流光溢彩的街道', '映在窗边', '列车高登重霄', '像轻抚夜空般驶去', '点起些许勇气', '轻哼星回诗歌'
    ],  // 星回诗歌 - suis
    [
        '比起暗无天日的自由', '不如给我', '身负镣铐的光芒'
    ],  // 琥珀的身体 - HIMEHINA
    [
        'やけに白いんだ', 'やたら長いんだ', 'コタエはだいたい', 'カタチばかりの', '常識だろう', '指先が震えようとも'
    ],  // 空之箱 - トゲナシトゲアリ
    [
        '提交的试卷空白', '可混乱思绪冗长', '所谓的答案', '大概也只是', '形式上的常识罢了', '纵使指尖颤抖'
    ],   // 空之箱 - トゲナシトゲアリ
    [
        '在这地图并未记载的', '三岔路口', '我们会相互邂逅吗', '我们应该', '依靠什么前行才好呢', '老师常言教科书上的',
        '才是正确答案', '可上面皆是难懂的话语', '我们从今天至此', '都毫无改变', '将这空格填上的话', '之后就能解开吗',
        '你会做何抉择', '是要继续前行吗'
    ],   // 空之箱 - トゲナシトゲアリ
    [
        '人生没有正确答案', '所以没有什么败北', '我今生今世都依旧是我', '仅此而已啊', '再继续涂写下去', '也没有明日'
    ],   // 空之箱 - トゲナシトゲアリ
    [
        '呐，事到如今', '也能够回忆起啊', '无色世界残留的香味里', '不断地积攒着后悔', '与其哭着说不能忘记', 
        '只需将我们笼罩吧', '夏霞'
    ],  // 夏霞 - あたらよ
    [
        '向着远方 遥远的远方', '让灵魂脱出沉重躯壳外', '向着那远方', '穿过云海', '追寻着彼方而去', '乘着清风', 
        '任凭想象力', '像反方向的重力一样',
        '让我飘向天际', '向着远方', '云端的远方', '那片海所在的地方'
    ],  // 老人与海 - ヨルシカ
    [
        '一如以往的景色', '正午尚浅', '高架桥下', '蓝二乘', '我躺卧不动', '为白纸一样的人生', '响着唯一的掌声', 
        '今天也歌颂着', '空无所有的我'
    ],  // 蓝二乘 - ヨルシカ
    [
        '接上电源', '记得装备好', '绝缘护具', '摆好棋子', '开始吧 对象生成', '输入我的参数', '数据初始化', 
        '设定好我们的新世界', '开始吧 模拟程序'
    ],  // world.execute(me); - Mili
    [
        '众人皆存于', '同样的生命之上', '若是无处可栖', '就翱翔天际吧', '命运相互纠缠', '轰然将其余道路', '蚕食殆尽', '我余下的人生',
        '就用来与你一同歌唱', '此处无光亦无风', '宛若与世隔绝般', '痛苦且艰辛', '遍体鳞伤令我厌恶一切', '纵使张开的羽翼', '千疮百孔',
        '倘若于地狱之渊', '仍能与你放声高歌'
    ],  // 命运之花 - トゲナシトゲアリ
    [
        '曾经渴望消逝', '渴望高飞', '而在此刻', '却再无此念', '纵使被摘下', '终有一日会依在此地', '绚烂绽放', 
        '那个渴望消逝的我', '已然消逝','此刻只觉未曾消逝真好', '只因与你相逢而绽放的', '命运之花'
    ],  // 命运之花 - トゲナシトゲアリ
    [
        '被囚禁于过去式胶卷的', '我们', '宛如任由粘土饮水般', '不知何时开始逐渐凝固', '只因话语税不足',
        '我便轻轻用力', '将反复书写的草稿', '涂抹殆尽', '没关系的', '不过只是有谁', '化作了透明人'
    ],  // 等雨 - 美波
    [
        '果然', '今天也一样失败了啊', '能否为隔着取景器', '口渴难耐的我', '降下雨滴呢', 
        '无论重新冲刷多少次', '依然浑浊不堪的我', '如今已无法将这曲歌词', '传达到你耳边',
        '模棱两可的语言', '想必无法化解', '早已凝固的我', '为何我的内心', '变得如此空虚了呢',
        '对这普遍化现象', '也逐渐麻木'
    ],  // 等雨 - 美波
    [
        '此刻', '犹如艳花般高贵', '而骄傲地绽放', '舍弃少女柔弱之心', '不需要王子的保护',
        '用双手开创自己的命运', '直到这具身躯腐朽为止'
    ],  // 前往新世界 - 存流/明透
    [
        '看到崭新的世界', '呼吸也随之停止下来', '令我眼花缭乱', '内心深处里', '神秘而坚强的意志',
        '正熊熊燃烧'
    ],  // 前往新世界 - 存流/明透
    [
        '在你描绘的未来中', '与你坚定地站在一起', '不要害怕', '只需目视前方', '即使是面对', '突如其来的疼痛',
        '也要走在', '一路荆棘的道路上', '不存在毫无价值的伤疤'
    ],  // 前往新世界 - 存流/明透
    [
        '哪有什么绝望', '真相是有害的', '仿佛位于', '不存在于现实的', '海市蜃楼当中', '我不介意隐藏自身存在',
        '反正与格格不入的我', '豪不相干', '大脑早已支离破碎', '看吧', '教育永远不会认同', '我的品格',
        '强迫我解出', '没有正确答案的问题', '“我什么都不懂”', '孤身一人的我如此呐喊', '若要为了他人而活',
        '就是在削减仅限的生命', '谁都在说年轻世代', '必须为别人做的事情', '负起全责', '但究竟要补偿谁？',
        '做到何种程度？', '该如何做到？', '我根本不懂!', '受到伤害', '导致他人受伤', '既痛苦又难受',
        '每种情绪都充斥着无奈', '眼前早已因浸湿而', '看不到方向', '仿佛一切都可能消失'
    ],  // 互相伤害 疼痛交加 - トゲナシトゲアリ
    [
        '今夜抬头 穹顶也有', '美丽的满月闪闪发光', '好像幸福地照耀着世界', '可现在的我', '一无是处 无药可救',
        '像在黎明的梦中', '在地上来回匍匐着', '尽管如此', '还是想被你找到', '我对着天空', '呼喊着', 
        '好想逃走啊', '可我无法逃脱', '未来的光明', '看不到了啊', '尽管如此', '还是想被你找到',
        '如蝴蝶般飞舞', '挥着残缺的翅膀', '就像是星星魍魉的初月'
    ],  // ミカヅキ - さユり

]

export const attackSayConstant = []

export const deathSayConstant = []